spec/fixtures/get-portfolios-request.xml

<soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:oper="http://www.creditsafe.com/globaldata/operations" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://www.creditsafe.com/globaldata/datatypes" xmlns:cred="http://schemas.datacontract.org/2004/07/Creditsafe.GlobalData" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
  <soapenv:Body>
    <oper:GetPortfolios>
      <oper:portfolioIds>
        <arr:unsignedInt>14462</arr:unsignedInt>
        <arr:unsignedInt>14461</arr:unsignedInt>
      </oper:portfolioIds>
    </oper:GetPortfolios>
  </soapenv:Body>
</soapenv:Envelope>
