spec/fixtures/company-report-request.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:oper="http://www.creditsafe.com/globaldata/operations" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://www.creditsafe.com/globaldata/datatypes" xmlns:cred="http://schemas.datacontract.org/2004/07/Creditsafe.GlobalData"><soapenv:Body><oper:RetrieveCompanyOnlineReport><oper:companyId>GB003/0/07495895</oper:companyId><oper:reportType>Full</oper:reportType><oper:language>EN</oper:language><oper:customData><dat:Entries><dat:Entry key="foo">bar</dat:Entry><dat:Entry key="bar">baz</dat:Entry></dat:Entries></oper:customData></oper:RetrieveCompanyOnlineReport></soapenv:Body></soapenv:Envelope>
