spec/fixtures/get-supported-change-event-request.xml

<soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:oper="http://www.creditsafe.com/globaldata/operations" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://www.creditsafe.com/globaldata/datatypes" xmlns:cred="http://schemas.datacontract.org/2004/07/Creditsafe.GlobalData" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
  <soapenv:Body>
    <oper:GetSupportedChangeEvents>
      <oper:language>EN</oper:language>
      <oper:country>NL</oper:country>
    </oper:GetSupportedChangeEvents>
  </soapenv:Body>
</soapenv:Envelope>
