spec/fixtures/set-portfolio-monitoring-rules-request.xml

<soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:oper="http://www.creditsafe.com/globaldata/operations" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://www.creditsafe.com/globaldata/datatypes" xmlns:cred="http://schemas.datacontract.org/2004/07/Creditsafe.GlobalData" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
  <soapenv:Body>
    <oper:SetMonitoringRules>
      <oper:portfolioId>12422</oper:portfolioId>
      <oper:newRules>
        <dat:Rule Enabled="true" EventCode="CR" MatchAllConditions="true"/>
        <dat:Rule Enabled="true" EventCode="PR" MatchAllConditions="true"/>
        <dat:Rule Enabled="true" EventCode="NC" MatchAllConditions="true"/>
        <dat:Rule Enabled="true" EventCode="AC" MatchAllConditions="true"/>
        <dat:Rule Enabled="true" EventCode="DN" MatchAllConditions="true"/>
        <dat:Rule Enabled="true" EventCode="EC" MatchAllConditions="true"/>
        <dat:Rule Enabled="true" EventCode="FN" MatchAllConditions="true"/>
        <dat:Rule Enabled="true" EventCode="UC" MatchAllConditions="true"/>
        <dat:Rule Enabled="true" EventCode="IC" MatchAllConditions="true"/>
        <dat:Rule Enabled="true" EventCode="CL" MatchAllConditions="true"/>
        <dat:Rule Enabled="true" EventCode="HO" MatchAllConditions="true"/>
        <dat:Rule Enabled="true" EventCode="BN" MatchAllConditions="true"/>
      </oper:newRules>
    </oper:SetMonitoringRules>
  </soapenv:Body>
</soapenv:Envelope>
