spec/fixtures/find-companies-request.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:oper="http://www.creditsafe.com/globaldata/operations" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://www.creditsafe.com/globaldata/datatypes" xmlns:cred="http://schemas.datacontract.org/2004/07/Creditsafe.GlobalData"><soapenv:Body><oper:FindCompanies><oper:countries><cred:CountryCode>GB</cred:CountryCode></oper:countries><oper:searchCriteria><dat:RegistrationNumber>RN123</dat:RegistrationNumber></oper:searchCriteria></oper:FindCompanies></soapenv:Body></soapenv:Envelope>
